package com.lamtev.poker.core;

//TODO: не понятно, как играть через это апи
// методы ничего не принимают, ничего не возвращают
// вот дали мне это апи, делаю я клиента для покера,
// опрашиваю пользователей "чего изволите" для простоты последовательно (последовательно ходят?).
// хочу там игроков создать, ставки, карты брать/не брать, отрисовать у кого какие. Узнать кто победил...
// А как??

//ANSWER: да, тут пока нет всяких геттеров, которые нужны. Согласен. Но пока просто не успел или забыл...

public interface PokerAPI {
    void call();
    void raise(int additionalWager);
    void fold();
    void check();
}
